denis-koshenkov/env-alert-system/src/hal/impl/nrf52840dk/hw_platform.c
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include <zephyr/drivers/spi.h>
#include <zephyr/devicetree.h>
#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/gap.h>
#include <zephyr/bluetooth/uuid.h>
#include <zephyr/bluetooth/conn.h>

#include "nrfx_twim.h"

#include "hw_platform.h"
#include "hw_platform_private.h"
#include "virtual_led_nrf52840.h"
#include "eas_assert.h"
#include "virtual_sht31.h"
#include "virtual_bmp280.h"
#include "virtual_bh1750.h"
#include "virtual_transceiver_nrf_ble.h"
#include "central_event_queue.h"
#include "eas_timer.h"
#include "sht3x.h"
#include "sht3x/get_instance_memory.h"
#include "sht3x/interface.h"
#include "bh1750.h"
#include "bh1750/get_instance_memory.h"
#include "bh1750/interface.h"
#include "bmp280.h"
#include "bmp280/get_inst_buf.h"
#include "bmp280/interface.h"
#include "eas_log.h"
#include "ops_queue.h"

#include "eass.h"

EAS_LOG_ENABLE_IN_FILE();

/* Macros to use as result parameter of hw platform init cb - for readability */
#define HW_PLATFORM_INIT_SUCCESS true
#define HW_PLATFORM_INIT_FAILURE false

/* Pin numbers are taken from nrf52840dk_nrf52840-pinctrl.dtsi */
#define I2C_SCL_PIN 27
#define I2C_SDA_PIN 26
/* TWIM does not support 1000K */
#define I2C_TWIM_FREQ NRF_TWIM_FREQ_400K

#define SHT31_I2C_ADDR 0x44
/* ADDR pin low */
#define BH1750_I2C_ADDR 0x23

/* Time that it takes for all sensors to be powered on after a power-on reset. Hw platform init waits for this amount of
 * time before communicating with any sensors. This is the maximum of the following values:
 * - BMP280: 2 ms
 * - SHT31: 1.5 ms
 * - BH1750: unknown
 */
#define HW_PLATFORM_MAX_SENSOR_POWER_ON_TIME_MS 2

/* Forward declaration to assign this function as callback to a static variable */
static void zephyr_spi_callback(const struct device *dev, int result, void *data);

/** @brief I2C result codes that describe the outcome of an I2C transaction. */
typedef enum {
    /** @brief I2C transaction successful. */
    I2C_RESULT_CODE_OK,
    /** @brief Generic I2C error. */
    I2C_RESULT_CODE_ERR,
    /** @brief NACK after sending the address byte. */
    I2C_RESULT_CODE_ADDR_NACK,
} I2cResultCode;

#define SPI_OP_FLAGS (SPI_OP_MODE_MASTER | SPI_TRANSFER_MSB | SPI_WORD_SET(8))
#define SPI_CS_DELAY 0
static const struct spi_dt_spec spi_spec = SPI_DT_SPEC_GET(DT_NODELABEL(bmp280), SPI_OP_FLAGS, SPI_CS_DELAY);

/* Maximum number of I2C operations that can be in the queue at the same time. We have two I2C sensors. We reserve two
 * slots in the queue for each sensor to handle the case when a sensor completes a I2C operation, the next operation
 * is started (and pushed to the queue), and only then ops_queue_op_complete is called. This can result in two I2C
 * operations being in the queue for one sensor. We have not seen asserts/crashes when queue size is 2, so this is
 * mostly for safety, but this case is theoretically possible. */
#define I2C_QUEUE_MAX_NUM_OPS 4
static OpsQueue i2c_queue;
static I2cOperation i2c_queue_ops_buf[I2C_QUEUE_MAX_NUM_OPS - 1];
static I2cOperation i2c_queue_op_buf;

/** Callback data for the I2C operation currently in progress. Once the I2C transaction is complete, this callback will
 * be executed. */
static I2cCompleteCbData i2c_complete_cb_data;

#define TWIM_INST_IDX 0
static nrfx_twim_t twim_inst = NRFX_TWIM_INSTANCE(NRF_TWIM_INST_GET(TWIM_INST_IDX));

/* SHT31 driver related */
static SHT3X sht3x_inst;
static EasTimer sht31_driver_timer;
static SHT3XTimerData sht3x_timer_data = {
    .cb = NULL,
    .user_data = NULL,
    .eas_timer_inst_p = &sht31_driver_timer,
};

/* BH1750 driver related */
static BH1750 bh1750_inst;
static EasTimer bh1750_driver_timer;
static BH1750TimerData bh1750_timer_data = {
    .cb = NULL,
    .user_data = NULL,
    .eas_timer_inst_p = &bh1750_driver_timer,
};

/* BMP280 driver related */
static BMP280 bmp280_inst;
static SpiOpData spi_op_data = {
    .cb = NULL,        // Will be populated by bmp280_driver_read/write_reg(s)
    .user_data = NULL, // Will be populated by bmp280_driver_read/write_reg(s)
    .spi_spec = &spi_spec,
    .zephyr_spi_cb = zephyr_spi_callback,
};
static EasTimer bmp280_driver_timer;
static BMP280TimerData bmp280_timer_data = {
    .cb = NULL,        // Will be populated by bmp280_driver_start_timer
    .user_data = NULL, // Will be populated by bmp280_driver_start_timer
    .eas_timer_inst_p = &bmp280_driver_timer,
};

/* Bluetooth related */

#define DEVICE_NAME CONFIG_BT_DEVICE_NAME
#define DEVICE_NAME_LEN (sizeof(DEVICE_NAME) - 1)

/* Advertising packet */
static const struct bt_data ad[] = {
    BT_DATA_BYTES(BT_DATA_FLAGS, (BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR)),
    /* Include full device name in advertising packet data */
    BT_DATA(BT_DATA_NAME_COMPLETE, DEVICE_NAME, DEVICE_NAME_LEN),
};

/* Scan response packet */
static const struct bt_data sd[] = {
    BT_DATA_BYTES(BT_DATA_UUID128_ALL, BT_UUID_EASS_VAL),
};

// clang-format off
static const struct bt_le_adv_param *adv_param = BT_LE_ADV_PARAM(
    (BT_LE_ADV_OPT_CONN | BT_LE_ADV_OPT_USE_IDENTITY),
    800,  /* Min Advertising Interval 500ms (800*0.625ms) */
    801,  /* Max Advertising Interval 500.625ms (801*0.625ms) */
    NULL /* Set to NULL for undirected advertising*/
);
// clang-format on

static EasTimer eass_tx_timer;

static void start_advertising_impl(void *user_data)
{
    int err = bt_le_adv_start(adv_param, ad, ARRAY_SIZE(ad), sd, ARRAY_SIZE(sd));

    if (err) {
        EAS_LOG_INF("Advertising failed to start (err %d)", err);
        return;
    }

    EAS_LOG_INF("Advertising successfully started");
}

static void submit_start_advertising_event(void)
{
    central_event_queue_submit_void_cb_with_user_data_event(start_advertising_impl, NULL);
}

static void recycled_cb(void)
{
    EAS_LOG_INF("Connection object available from previous conn. Disconnect is complete!");
    submit_start_advertising_event();
}

static void on_connected(struct bt_conn *conn, uint8_t err)
{
    if (err) {
        EAS_LOG_INF("Connection failed (err %u)", err);
        return;
    }

