denis-koshenkov/env-alert-system/src/hal/impl/nrf52840dk/hw_platform.c
    rc = bh1750_init(bh1750_inst, init_part_2_complete, NULL);
    EAS_ASSERT(rc == BH1750_RESULT_CODE_OK);
}

/**
 * @brief Callback to execute once part 1 of hw platform init is complete.
 *
 * This submits part 2 of hw platform init to the central event queue as a callback to execute.
 *
 * @param result_code Signifies whether the SHT3X reset was successful.
 * @param user_data User data, unused in this callback.
 */
static void init_part_1_complete(uint8_t result_code, void *user_data)
{
    if (result_code == SHT3X_RESULT_CODE_OK) {
        central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_2, NULL);
    } else {
        execute_hw_init_complete_cb(HW_PLATFORM_INIT_FAILURE);
    }
}

static void hw_platform_init_part_1(void *user_data)
{
    uint8_t rc;
    SHT3XInitConfig sht3x_cfg = {
        .get_instance_memory = sht3x_driver_get_instance_memory,
        .get_instance_memory_user_data = NULL,
        .i2c_write = sht3x_driver_i2c_write,
        .i2c_write_user_data = (void *)&i2c_queue,
        .i2c_read = sht3x_driver_i2c_read,
        .i2c_read_user_data = (void *)&i2c_queue,
        .start_timer = sht3x_driver_timer_start,
        .start_timer_user_data = (void *)&sht3x_timer_data,
        .i2c_addr = SHT31_I2C_ADDR,
    };
    rc = sht3x_create(&sht3x_inst, &sht3x_cfg);
    EAS_ASSERT(rc == SHT3X_RESULT_CODE_OK);

    /* Put SHT31 device into a known default state */
    rc = sht3x_soft_reset_with_delay(sht3x_inst, init_part_1_complete, NULL);
    EAS_ASSERT(rc == SHT3X_RESULT_CODE_OK);
}

static void init_part_0_complete(void *user_data)
{
    central_event_queue_submit_void_cb_with_user_data_event(hw_platform_init_part_1, NULL);
}

void hw_platform_init(HwPlatformCompleteCb cb, void *user_data)
{
    hw_init_complete_cb = cb;
    hw_init_complete_cb_user_data = user_data;

    init_nrfx_twim();
    sht31_driver_timer = eas_timer_create(0, EAS_TIMER_ONE_SHOT, sht31_driver_timer_expired_cb, NULL);
    bh1750_driver_timer = eas_timer_create(0, EAS_TIMER_ONE_SHOT, bh1750_driver_timer_expired_cb, NULL);
    bmp280_driver_timer = eas_timer_create(0, EAS_TIMER_ONE_SHOT, bmp280_driver_timer_expired_cb, NULL);
    /* Pass twim_inst as user data to i2c_queue_start_op - it uses the twim inst to start I2C transactions */
    i2c_queue = ops_queue_create(sizeof(I2cOperation), I2C_QUEUE_MAX_NUM_OPS, i2c_queue_ops_buf, &i2c_queue_op_buf,
                                 i2c_queue_start_op, &twim_inst);

    EAS_ASSERT(spi_is_ready_dt(&spi_spec));

    hw_platform_timer =
        eas_timer_create(HW_PLATFORM_MAX_SENSOR_POWER_ON_TIME_MS, EAS_TIMER_ONE_SHOT, init_part_0_complete, NULL);
    eas_timer_start(hw_platform_timer);
}

const Led *const hw_platform_get_led()
{
    return led_nrf52840_get();
}

const TemperatureSensor *const hw_platform_get_temperature_sensor()
{
    EAS_ASSERT(temperature_sensor);
    return temperature_sensor;
}

const PressureSensor *const hw_platform_get_pressure_sensor()
{
    EAS_ASSERT(pressure_sensor);
    return pressure_sensor;
}

const HumiditySensor *const hw_platform_get_humidity_sensor()
{
    EAS_ASSERT(humidity_sensor);
    return humidity_sensor;
}

const LightIntensitySensor *const hw_platform_get_light_intensity_sensor()
{
    EAS_ASSERT(light_intensity_sensor);
    return light_intensity_sensor;
}

const Transceiver *const hw_platform_get_transceiver()
{
    return virtual_transceiver_nrf_ble_get();
}
